import { z } from "zod";

export const profileSchema = z.object({
    email: z
        .string()
        .email("Невірний формат електронної пошти")
        .min(5, "Email має містити не менше 5 символів")
        .max(255, "Email має містити не більше 255 символів")
        .optional(),

    phone_number: z
        .string()
        .min(9, "Номер телефону має бути щонайменше 9 символів")
        .max(11, "Номер телефону не може бути довше 11 символів")
        .regex(/^\d+$/, "Номер телефону має містити лише цифри")
        .optional(),

    first_name: z
        .string()
        .min(2, "Ім’я має містити щонайменше 2 символи")
        .max(50, "Ім’я має містити не більше 50 символів")
        .regex(/^[A-Za-zА-Яа-яІіЇїЄєҐґ\-' ]+$/u, "Ім’я може містити лише літери, дефіси, апострофи та пробіли")
        .optional(),

    last_name: z
        .string()
        .min(2, "Прізвище має містити щонайменше 2 символи")
        .max(50, "Прізвище має містити не більше 50 символів")
        .regex(/^[A-Za-zА-Яа-яІіЇїЄєҐґ\-' ]+$/u, "Прізвище може містити лише літери, дефіси, апострофи та пробіли")
        .optional(),

    patronymic: z
        .string()
        .min(2, "По батькові має містити щонайменше 2 символи")
        .max(50, "По батькові має містити не більше 50 символів")
        .regex(/^[A-Za-zА-Яа-яІіЇїЄєҐґ\-' ]+$/u, "По батькові може містити лише літери, дефіси, апострофи та пробіли")
        .optional()
});

export type ProfileSchema = z.infer<typeof profileSchema>;
